In [3]:
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.8.6-cp36-cp36m-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6

In [9]:
from sqlalchemy import create_engine
from config import username, password
import pandas as pd

In [10]:
#create seperate config.py file to insert psycopg2 username/password DONE WOOHOO
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/SQL-Challenge')
# engine = create_engine('postgresql://localhost:5432/SQL-Challenge')
connection = engine.connect()

In [12]:
employee_df = pd.read_sql('select * from employees', connection)

In [13]:
employee_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991